skagus/stm32_temaplate/utils/os.cpp
#include <string.h>
#include <stm32f10x.h>
#include <core_cm3.h>
#include "macro.h"
#include "os.h"
#include "cli.h"

#if (1) // defined(__riscv__)
typedef void* TCB;
#else
typedef SimTaskId TCB;
#endif
struct OS_Info
{
	uint8	_numTask;		///< Number of Task.
	uint8	_bInCritical;	///< The OS in critical section.(Never context switch in critical section)
	uint32	_curTID;		///< 현재 해당 CPU에서 돌고있는 task ID.
	uint32	_bmRdyTask;		///< Ready task bitmap, (_aBlockBy보다 우선순위 높음)
	uint32	_bmLocked;		///< Resource bitmap that is locked.

	uint32	_nTick;					///< Just tick counter
	uint32	_nTmpTick;				///< Tick count for async tick up.
	uint32	_bmAsyncEvt;			///< Async event중 처리되지 않은 것.

	uint32	_aWaitEvt[MAX_TASK];	///< Task가 기다리는 event, wakeup상태에서도 의미있음.
	int32	_aExpire[MAX_TASK];		///< Remainning tick to ready.(only for tick event)
	Task	_pfTask[MAX_TASK];	///< Task entry.
	void* _pParam[MAX_TASK];	///< Task parameter.
	TCB		_aTCB[MAX_TASK];	///< TCB 상당의 무엇인데, sim에서는 fiber id와 대응됨.
	void* pStkTop[MAX_TASK];
	uint32	anCntSched[MAX_TASK];
	const char* aszName[MAX_TASK];
} gstOS;

#if defined(__arm__) || defined(__riscv__)
void* pCurTCB;
#endif

void	os_handleAsyncEvt(void);
void	os_applyEvt(uint32 bmNewEvt);


void os_SetNextTask(void)
{
	ASSERT(!gstOS._bInCritical);
	uint8 nPrvTID = gstOS._curTID;
	uint8 nNxtTID = gstOS._curTID;

	os_handleAsyncEvt();
	uint32 bmRdy = gstOS._bmRdyTask;
	while (1)
	{
		++nNxtTID;
		if (nNxtTID >= gstOS._numTask)
		{
			nNxtTID = 0;
		}

		if (bmRdy & BIT(nNxtTID))
		{
			break;
		}
		else if (nPrvTID == nNxtTID)
		{
			ASSERT(0 == bmRdy);
			// Ready event가 하나도 없음.
			// interrupt를 기다려야 한다. (interrupt 대신 event)
			// interrupt대신 event를 더 자주 깨어나서 overhead증가하지만, 
			// simulation의 정확도 측면에선 차이가 없다.
#if (EN_SIM)
			CPU_Sleep();
#else
//			__WFI();
#endif
			os_handleAsyncEvt();
			bmRdy = gstOS._bmRdyTask;
		}
	}
	gstOS._curTID = nNxtTID;
	gstOS.anCntSched[nNxtTID]++;
#if defined(__arm__) || defined(__riscv__)
	pCurTCB = &(gstOS._aTCB[nNxtTID]);
#endif
}


uint8 OS_CreateTask(Task pfEntry, void* pStkTop, void* nParam, const char* szName)
{
	uint8 nTaskID = gstOS._numTask;
	ASSERT(nTaskID < MAX_TASK);
	gstOS._aExpire[nTaskID] = 0;
	gstOS._bmRdyTask |= BIT(nTaskID); // initial state = ready.
	gstOS._pfTask[nTaskID] = pfEntry;
	gstOS._pParam[nTaskID] = nParam;
	gstOS.aszName[nTaskID] = szName;
	gstOS.pStkTop[nTaskID] = (uint32*)pStkTop - 1;
	gstOS._numTask++;
	return nTaskID;
}


#if defined(__arm__)
void* os_InitStk(Task pfTask, void* pInStkTop, void* pParam)
{
	uint32* pStk = (uint32*)pInStkTop;

	pStk--; *pStk = (uint32)pfTask;	/* R14 */
	pStk--; *pStk = 0xAC;	/* R12 */
	pStk--; *pStk = 0xAB;	/* R11 */
	pStk--; *pStk = 0xAA;	/* R10 */
	pStk--; *pStk = 0xA9;	/* R9 */
	pStk--; *pStk = 0xA8;	/* R8 */
	pStk--; *pStk = 0xA7;	/* R7 */
	pStk--; *pStk = 0xA6;	/* R6 */
	pStk--; *pStk = 0xA5;	/* R5 */
	pStk--; *pStk = 0xA4;	/* R4 */
	pStk--; *pStk = 0xA3;	/* R3 */
	pStk--; *pStk = 0xA2;	/* R2 */
	pStk--; *pStk = 0xA1;	/* R1 */
	pStk--; *pStk = (uint32)pParam;	/* R0 */
	return pStk;
}

__attribute__((naked)) void os_Switch()
{
	__asm__ __volatile__("stmdb sp!, {r0-r12, r14}");
	__asm__ __volatile__("ldr r3, =pCurTCB");
	__asm__ __volatile__("ldr r2, [r3]");
	__asm__ __volatile__("str sp, [r2]");	// store SP to Active TCB.

	os_SetNextTask();	// Should change the value of pCurTCB.

	__asm__ __volatile__("ldr r3, =pCurTCB");
	__asm__ __volatile__("ldr r2, [r3]");
	__asm__ __volatile__("ldr sp, [r2]");	// load SP from Active TCB.
	__asm__ __volatile__("ldmia sp!, {r0-r12, r14}");
	__asm__ __volatile__("isb");

	__asm__ __volatile__("bx r14");
}
#elif defined(__riscv__)
void* os_InitStk(Task pfTask, void* pInStkTop, void* pParam)
{
	uint32* pStk = (uint32*)pInStkTop;

	*pStk = 0xAB;pStk--;
	*pStk = 0xAA;pStk--;
	*pStk = 0xA9;pStk--;
	*pStk = 0xA8;pStk--;
	*pStk = 0xA7;pStk--;
	*pStk = 0xA6;pStk--;
	*pStk = 0xA5;pStk--;
	*pStk = 0xA4;pStk--;
	*pStk = 0xA3;pStk--;
	*pStk = 0xA2;pStk--;
	*pStk = 0xA1;pStk--;
	*pStk = (uint32)pParam;pStk--;	/* param */
	*pStk = (uint32)pfTask;
	return pStk;
}

/**
 * For co-operative OS, switch should save callee save register only.
*/
__attribute__((naked)) void os_Switch(void)
{
	__asm__ __volatile__("addi sp,sp,-52");

	__asm__ __volatile__("sw ra, 0(sp)");
	__asm__ __volatile__("sw s0, 4(sp)");
	__asm__ __volatile__("sw s1, 8(sp)");
	__asm__ __volatile__("sw s2, 12(sp)");
	__asm__ __volatile__("sw s3, 16(sp)");
	__asm__ __volatile__("sw s4, 20(sp)");
	__asm__ __volatile__("sw s5, 24(sp)");
	__asm__ __volatile__("sw s6, 28(sp)");
	__asm__ __volatile__("sw s7, 32(sp)");
	__asm__ __volatile__("sw s8, 36(sp)");
	__asm__ __volatile__("sw s9, 40(sp)");
	__asm__ __volatile__("sw s10, 44(sp)");
	__asm__ __volatile__("sw s11, 48(sp)");

#if 1
	__asm__ __volatile__("lw a0, %[tcb]"::[tcb]"m"(pCurTCB));
	__asm__ __volatile__("sw sp, 0(a0)");

	os_SetNextTask();

	__asm__ __volatile__("lw a0, %[tcb]"::[tcb]"m"(pCurTCB));
	__asm__ __volatile__("lw sp, 0(a0)");
#else
	__asm__ __volatile__("sw sp, %[tcb]": [tcb] "=m"(pCurTCB) : );
	os_SetNextTask();
	__asm__ __volatile__("lw sp, %[tcb]"::[tcb]"m"(pCurTCB));
#endif

	__asm__ __volatile__("lw ra, 0(sp)");
	__asm__ __volatile__("lw s0, 4(sp)");
	__asm__ __volatile__("lw s1, 8(sp)");
	__asm__ __volatile__("lw s2, 12(sp)");
	__asm__ __volatile__("lw s3, 16(sp)");
	__asm__ __volatile__("lw s4, 20(sp)");
	__asm__ __volatile__("lw s5, 24(sp)");
	__asm__ __volatile__("lw s6, 28(sp)");
	__asm__ __volatile__("lw s7, 32(sp)");
	__asm__ __volatile__("lw s8, 36(sp)");
	__asm__ __volatile__("lw s9, 40(sp)");
	__asm__ __volatile__("lw s10, 44(sp)");
	__asm__ __volatile__("lw s11, 48(sp)");

	__asm__ __volatile__("addi sp,sp,52");

	__asm__ __volatile__("ret");
}
#endif

/**
등록된 Task를 모두 fiber로 만든다.

특히 0번 Task는 current thread를 이용해서 만드는데,
이는 simulator환경에서는 guest CPU는 fiber로 변경되어 있기 때문이다.

*/
void OS_Start()
{
#if defined(EN_SIM)
	for (int i = 1; i < gstOS._numTask; i++)
	{
		gstOS._aTCB[i] = CO_RegTask(gstOS._pfTask[i], gstOS._pParam[i], (gstOS.pStkTop[i]));
	}
	gstOS._aTCB[0] = CO_GetCurTask();
#elif defined(__arm__) || defined(__riscv__)
	for (int i = 1; i < gstOS._numTask; i++)
	{
		gstOS._aTCB[i] = os_InitStk(gstOS._pfTask[i], gstOS.pStkTop[i], gstOS._pParam[i]);
	}
	pCurTCB = &(gstOS._aTCB[0]);
#endif
	// Call task 0 (not return).
	gstOS._curTID = 0;
	gstOS._nTmpTick = 0;
	gstOS._pfTask[0](gstOS._pParam[0]);
	ASSERT(0);
}

/**
Wait multi event with timeout
@param bmEvent bitmap of event that the task wait.
@param nTO Timeout to wait.
@return Event that reached.
*/
uint32 OS_Wait(uint32 bmEvt, uint32 nTO)
{
	ASSERT(!gstOS._bInCritical);
	ASSERT(gstOS._bmRdyTask & BIT(gstOS._curTID));
	if (0 != nTO)	// Yield case.
	{
		BIT_CLR(gstOS._bmRdyTask, BIT(gstOS._curTID));
		gstOS._aExpire[gstOS._curTID] = nTO;
		gstOS._aWaitEvt[gstOS._curTID] = bmEvt;
	}

#if defined(EN_SIM)
	os_SetNextTask();
	//	SIM_Print("Sched: %s\n", gstOS.aszName[gstOS._curTID]);
	CO_Switch(gstOS._aTCB[gstOS._curTID]);
	CPU_TimePass(SIM_USEC(50));
#elif defined(__arm__) || defined(__riscv__)
	os_Switch();
#endif

	return gstOS._aWaitEvt[gstOS._curTID];
}

void OS_Tick(void)
{
	gstOS._nTmpTick++;
}

/**
Interrupt에 의해 만들어진 event의 경우
ISR context에서 당장 하는게 아니라 event flag만 켜 둔다.
추후에 main thread가 처리할 수 있을 때 처리한다.

@remark 다른 CPU나 HW에서 호출되는 것이 일반적이며,
		이 경우, CPU id가 잘못지정되어 있을 수 있지만,
		ISR에서 current CPU ID를 바꿔준 다음에 call해주기 때문에,
		CPU ID는 정상값을 가지게 된다.
*/
void OS_AsyncEvt(uint32 bmEvt)
{
	gstOS._bmAsyncEvt |= bmEvt;
}

/**
하나의 event를 처리한다.
*/
void os_applyEvt(uint32 bmNewEvt)
{
	for (int nTaskId = 0; nTaskId < gstOS._numTask; nTaskId++)
	{
		if (gstOS._aWaitEvt[nTaskId] & bmNewEvt)
		{
			gstOS._bmRdyTask |= BIT(nTaskId);
			BIT_CLR(gstOS._aWaitEvt[nTaskId], bmNewEvt);
		}
	}
}

void os_handleAsyncEvt(void)
{
#if defined(EN_SIM)
	CPU_TimePass(0);
#endif

	if (gstOS._nTmpTick > 0)
	{
		uint32 nNewTick = gstOS._nTmpTick;
		gstOS._nTmpTick = 0;
		gstOS._nTick += nNewTick;
		for (uint8 i = 0; i < gstOS._numTask; i++)
		{
			if (gstOS._aExpire[i] > 0)
			{
				gstOS._aExpire[i] -= nNewTick;
				if (gstOS._aExpire[i] <= 0)
				{
					gstOS._bmRdyTask |= BIT(i);
					gstOS._aExpire[i] = 0;
				}
			}
		}
	}

	if (0 != gstOS._bmAsyncEvt)
	{
		uint32 bmEvts = gstOS._bmAsyncEvt;
		gstOS._bmAsyncEvt = 0;
		os_applyEvt(bmEvts);
	}
}

uint32 OS_GetTick()
{
	return gstOS._nTick;
};

/**
Sync event는 switching 하지 않는 것으로...
Sync event는 자기 자신은 제외해야하는 것 아닌가?
왜냐하면, 본인 event로 스스로 깨어나는 것은 논리적으로 말이 안됨.
*/
uint32 OS_SyncEvt(uint32 bmEvt)
{
	os_applyEvt(bmEvt);
	return 0;
}

/**
모든 task가 schedule이 될 수 없도록 한다.
물론, 이후에 새로운 event를 생성하는 경우에는 running이 가능하다.
*/
void OS_Stop(uint32 bmTask)
{
	BIT_CLR(bmTask, BIT(gstOS._curTID));
	BIT_CLR(gstOS._bmRdyTask, bmTask);
	for (int i = 0; i < gstOS._numTask; i++)
	{
		if (bmTask & BIT(i))
		{
			gstOS._aWaitEvt[i] = 0;
			gstOS._aExpire[i] = 0;
		}
	}
}

void OS_Lock(uint32 bmLock)
{
	while (bmLock)
	{
		uint8 nId = BIT_SCAN_LSB(bmLock);
		while (BIT(nId) & gstOS._bmLocked)
		{
			OS_Wait(BIT(EVT_LOCK), 0);
		}
		BIT_SET(gstOS._bmLocked, BIT(nId));
		BIT_CLR(bmLock, BIT(nId));
	}
}

void OS_Unlock(uint32 bmLock)
{
	BIT_CLR(gstOS._bmLocked, bmLock);
	OS_SyncEvt(BIT(EVT_LOCK));
}

/////////////////////////////

/**
OS운영을 위한 기본 Timer.
원칙적으로 ISR은 CPU time을 잡아먹어야 함.
TODO: 현재로선 ISR에서 CPU Time을 계산하는 기능은 없음.
	이 경우, Switch는 일어나지않고, Time만 증가시키는 방향으로 해야함.
	이런 경우 ISR이 계속 호출될 경우 main task는 실행될 시간이 없을 수 있음..!!
*/
void os_TickISR(uint32 nTag, uint32 nResult)
{
	UNUSED(nTag);
	UNUSED(nResult);
	OS_Tick();
	//	CPU_Wakeup(CPU_FTL);
}

Cbf OS_Init()
{
	memset((void*)&gstOS, 0x00, sizeof(gstOS));
#if defined(EN_SIM)
	TMR_Init();
	TMR_Add(0, TICK_SIM_PER_OS, os_TickISR, true);
#else
	return os_TickISR;
#endif
}
